Revit 2027 API
DividedSurface.GetReferencesWithDividedSurfaces Method
 For a given host element get references to all the faces that host a divided surface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<Reference> GetReferencesWithDividedSurfaces(
	Element host
)
Public Shared Function GetReferencesWithDividedSurfaces (
	host As Element
) As IList(Of Reference)
public:
static IList<Reference^>^ GetReferencesWithDividedSurfaces(
	Element^ host
)
static member GetReferencesWithDividedSurfaces :
        host : Element -> IList<Reference>
Parameters
host Element
 The element that hosts the divided surfaces
Return Value
IList<Reference>
 References that host a divided surface
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace